Revit 2024 API
BuiltInFailures.MechanicalFailures.LiningThicknessIsLargeForHeight Property
 Lining Thickness ([Lining Thickness Value]) is too large for current Height ([Height Value]).
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId LiningThicknessIsLargeForHeight { get; }
Visual Basic
Public Shared ReadOnly Property LiningThicknessIsLargeForHeight As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ LiningThicknessIsLargeForHeight {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.MechanicalFailures Class
Autodesk.Revit.DB Namespace